src/OneSBuild/src/Catalogs/УдалитьОчередьЗаданий/УдалитьОчередьЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УдалитьОчередьЗаданий</name>
  <attributes>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапланированныйМоментЗапуска</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Миллисекунды</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗадания</name>
    <type>
      <types>EnumRef.СостоянияЗаданий</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсполняющееФоновоеЗадание</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭксклюзивноеВыполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПопытки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяМетода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Параметры</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПоследнегоЗапуска</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияПоследнегоЗапуска</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ключ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалПовтораПриАварийномЗавершении</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПовторовПриАварийномЗавершении</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/OneSBuild/src/InformationRegisters/СвойстваЗаданий/СвойстваЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвойстваЗаданий</name>
  <resources>
    <name>Задание</name>
    <type>
      <types>CatalogRef.УдалитьОчередьЗаданий</types>
      <types>CatalogRef.ОчередьЗаданий</types>
    </type>
  </resources>
  <resources>
    <name>КодСостояния</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ошибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторСообщенияОбОшибке</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторРезультата</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/OneSBuild/src/Catalogs/ОчередьЗаданий/ОчередьЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОчередьЗаданий</name>
  <attributes>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапланированныйМоментЗапуска</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Миллисекунды</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗадания</name>
    <type>
      <types>EnumRef.СостоянияЗаданий</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсполняющееФоновоеЗадание</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭксклюзивноеВыполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныЗаданийОчереди</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПопытки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяМетода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Параметры</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПоследнегоЗапуска</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияПоследнегоЗапуска</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ключ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалПовтораПриАварийномЗавершении</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПовторовПриАварийномЗавершении</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/OneSBuild/src/Catalogs/УдалитьОчередьЗаданий/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Процедура ПеренестиЗадания() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных();
		Блокировка.Добавить("Справочник.УдалитьОчередьЗаданий");
		Блокировка.Добавить("Справочник.ОчередьЗаданий");
		Блокировка.Добавить("РегистрСведений.СвойстваЗаданий");
		Блокировка.Заблокировать();
		
		Выборка = Справочники.УдалитьОчередьЗаданий.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтароеЗадание = Выборка.ПолучитьОбъект();
			НовоеЗадание = Справочники.ОчередьЗаданий.СоздатьЭлемент();
			НовоеЗадание.Использование = СтароеЗадание.Использование;
			НовоеЗадание.ЗапланированныйМоментЗапуска = СтароеЗадание.ЗапланированныйМоментЗапуска;
			НовоеЗадание.Миллисекунды = СтароеЗадание.Миллисекунды;
			НовоеЗадание.СостояниеЗадания = СтароеЗадание.СостояниеЗадания;
			НовоеЗадание.ИсполняющееФоновоеЗадание = СтароеЗадание.ИсполняющееФоновоеЗадание;
			НовоеЗадание.ЭксклюзивноеВыполнение = СтароеЗадание.ЭксклюзивноеВыполнение;
			НовоеЗадание.НомерПопытки = СтароеЗадание.НомерПопытки;
			НовоеЗадание.ИмяМетода = СтароеЗадание.ИмяМетода;
			НовоеЗадание.Параметры = СтароеЗадание.Параметры;
			НовоеЗадание.ДатаНачалаПоследнегоЗапуска = СтароеЗадание.ДатаНачалаПоследнегоЗапуска;
			НовоеЗадание.ДатаЗавершенияПоследнегоЗапуска = СтароеЗадание.ДатаЗавершенияПоследнегоЗапуска;
			НовоеЗадание.Ключ = СтароеЗадание.Ключ;
			НовоеЗадание.ИнтервалПовтораПриАварийномЗавершении = СтароеЗадание.ИнтервалПовтораПриАварийномЗавершении;
			НовоеЗадание.Расписание = СтароеЗадание.Расписание;
			НовоеЗадание.КоличествоПовторовПриАварийномЗавершении = СтароеЗадание.КоличествоПовторовПриАварийномЗавершении;
			НовоеЗадание.ИмяПользователя = СтароеЗадание.ИмяПользователя;
			НоваяСсылка = Справочники.ОчередьЗаданий.ПолучитьСсылку(Выборка.Ссылка.УникальныйИдентификатор());
			НовоеЗадание.УстановитьСсылкуНового(НоваяСсылка);
			НовоеЗадание.ОбменДанными.Загрузка = Истина;
			НовоеЗадание.Записать();
			СтароеЗадание.ОбменДанными.Загрузка = Истина;
			СтароеЗадание.Удалить();
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СвойстваЗаданий.ИдентификаторЗадания
		|ИЗ
		|	РегистрСведений.СвойстваЗаданий КАК СвойстваЗаданий
		|ГДЕ
		|	СвойстваЗаданий.Задание ССЫЛКА Справочник.УдалитьОчередьЗаданий";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НаборЗаписей = РегистрыСведений.СвойстваЗаданий.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ИдентификаторЗадания.Установить(Выборка.ИдентификаторЗадания);
			НаборЗаписей.Прочитать();
			Для Каждого Запись Из НаборЗаписей Цикл
				Запись.Задание = Справочники.ОчередьЗаданий.ПолучитьСсылку(Запись.Задание.УникальныйИдентификатор());
			КонецЦикла;
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Записать();
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
		
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли
